#!/usr/bin/env python
# coding: utf-8

# In[ ]:


with open('stopwords/stop_words.txt', 'r', encoding='utf-8') as file:
    stopwords = [word.replace('\n', '') for word in file.readlines()]

#追加ストップワードを設定（助詞や意味のない平仮名１文字）
add_words = ['あ','い','う','え','お','か','き','く','け','こ','さ','し','す','せ','そ','た','ち','つ','て','と',
             'な','に','ぬ','ね','の','は','ひ','ふ','へ','ほ','ま','み','む','め','も','や','ゆ','よ',
             'ら','り','る','れ','ろ','わ','を','ん','が','ぎ','ぐ','げ','ご','ざ','じ','ず','ぜ','ぞ',
             'だ','ぢ','づ','で','ど','ば','び','ぶ','べ','ぼ','ぱ','ぴ','ぷ','ぺ','ぽ',
             'くん','です','ます','ました','そして','でも','だから','だが','くらい','その','それ','かも',
             'あれ','あの','あっ','そんな','この','これ','とか','とも','する','という','ござい',
             'ので','なんて','たら', 'られ','たい','さて','てる','ください','なる','けど','でし',
             'じゃん','だっ','なっ','でしょ', 'ある','って','こんな','ねえ'
            ]
stopwords = stopwords + add_words
    
